//
//  GalleryStore.swift
//  101
//
//  Created by 刘明 on 08/03/2026.
//

import Foundation

struct GalleryImage: Identifiable {
    let id = UUID()
    let name: String
    let keywords: [String]
}

class GalleryStore: ObservableObject {
    //static let shared = GalleryStore()
    @Published var images: [GalleryImage] = [
        GalleryImage(name: "image1", keywords: ["我", "台阶", "阶梯", "游客"]),
        GalleryImage(name: "image2", keywords: ["我", "天空", "天","屋檐", "瓦", "云","白云", "蓝色", "瓦片", "台阶", "阶梯"]),
        GalleryImage(name: "image3", keywords: ["我", "天空", "天","天坛", "夜晚", "月亮","树", "蓝色", "瓦片", "台阶", "阶梯"]),
        GalleryImage(name: "image4", keywords: ["天坛", "我", "天空", "天","圆形", "云","白云", "蓝色", "台阶", "阶梯"]),
        GalleryImage(name: "image5", keywords: ["天坛", "我", "天空", "天","圆形", "云","白云", "蓝色", "背影"]),
        GalleryImage(name: "image6", keywords: ["我", "天空", "天", "云","白云", "蓝色", "台阶", "阶梯", "屋顶","屋檐"]),
        GalleryImage(name: "image7", keywords: ["天坛", "我", "天空", "晚","月亮", "云","白云", "蓝色", "背影", "台阶", "阶梯"]),
        GalleryImage(name: "image8", keywords: ["天坛", "我", "砖", "墙","巨大", "砖墙","日光", "影子"]),
        GalleryImage(name: "image9", keywords: ["我", "站", "地上","低头", "砖","鞋", "砖缝", "地", "地下"]),
        GalleryImage(name: "image10", keywords: ["我", "站", "地上","低头", "砖","鞋", "砖缝", "地", "地下", "粗糙", "不规则"]),
        GalleryImage(name: "image11", keywords: ["我"]),
        GalleryImage(name: "image12", keywords: ["我", "背影", "照片","手", "拿着","低头"]),
        GalleryImage(name: "image13", keywords: ["屋檐", "云", "白云"]),
        GalleryImage(name: "image14", keywords: ["我", "天坛", "照片","手", "拿着","低头", "捏着"]),
        GalleryImage(name: "image15", keywords: ["我", "墙", "砖墙","影子", "日光","走", "阳光"]),
        GalleryImage(name: "image16", keywords: ["木门", "木制", "门环","铜", "铜铝","锈", "铜锈", "木头", "门缝", "粗糙"]),
        GalleryImage(name: "image17", keywords: ["雪", "红墙", "宫墙","墙", "枯树","树", "白雪", "下雪"]),
        GalleryImage(name: "image18", keywords: ["雪", "红墙", "宫墙","墙", "枯树","树", "白雪", "下雪","雾", "灯笼", "柿子", "屋顶"]),
        GalleryImage(name: "image19", keywords: ["屋檐", "灯笼", "宫灯","雾", "树"]),
        GalleryImage(name: "image20", keywords: ["车", "电车", "旅行","我"]),
        GalleryImage(name: "image21", keywords: ["我", "屋顶", "瓦","瓦片", "屋檐","树", "鸟", "风","云"]),
        GalleryImage(name: "dc-1", keywords: ["铛铛车", "视线", "金属","光线", "目光","记忆", "铛铛", "光束"]),
        GalleryImage(name: "dc-2", keywords: ["铛铛车", "视线", "广场","光线", "目光","仪式", "铛铛", "金色","光束"]),
        GalleryImage(name: "gg-1", keywords: ["我", "故宫", "红墙","记忆", "目光","纹理", "光线", "痕迹","历史"]),
        GalleryImage(name: "gg-2", keywords: ["我", "故宫", "红墙","记忆", "思绪","广场", "仪式", "古老","历史"]),
        GalleryImage(name: "js-1", keywords: ["我", "景山公园", "万春亭","目光", "思绪","光束", "金色", "轮廓","祥云"]),
        GalleryImage(name: "js-2", keywords: ["我", "景山公园", "万春亭","目光", "思绪","痕迹", "历史", "轮廓","纹理"]),
        GalleryImage(name: "nn-1", keywords: ["纹理", "记忆", "时间","墙", "痕迹","思绪", "古老", "石板","裂缝", "砖瓦", "裂纹", "石块","纹路","表面","门楣"]),
        GalleryImage(name: "nn-2", keywords: ["阳光", "街道", "建筑","空气", "天空","温度", "祥云", "目光","红墙", "时间", "裂纹", "层层","天际","屋檐"]),
        GalleryImage(name: "nn-3", keywords: ["光线", "纹理", "建筑","记忆", "痕迹","思绪", "历史", "古老","门洞", "石板", "裂纹", "砖瓦","石块","纹路","门楣"]),
        GalleryImage(name: "w-1", keywords: ["空", "计量", "液体","空气", "基准","阈值", "数值", "仪器","密度", "数据", "触感", "度量","容积","杯壁"]),
        GalleryImage(name: "w-2", keywords: ["空", "感官", "液体","空气", "边缘","容器", "裂纹", "阴影","缺口", "杯子", "蒸汽", "杯口","温度","杯壁","咖啡","咖啡杯"]),
        GalleryImage(name: "w-3", keywords: ["空", "感官", "勺子","空气", "边缘","容器", "光线", "阴影","缺口", "杯子", "触感", "杯口","温度","杯壁","容积","咖啡杯"]),
        GalleryImage(name: "w-4", keywords: ["空", "材质", "液体","空气", "边缘","容器", "裂纹", "阴影","工作台", "杯子", "触感", "杯口","温度","杯壁","台面"]),
        GalleryImage(name: "w-5", keywords: ["空", "桌面", "液体","透明", "边缘","容器", "玻璃杯", "阴影","光线", "杯子", "边缘", "杯口","空气","杯壁","玻璃"]),
        GalleryImage(name: "w-6", keywords: ["空", "计量", "液体","空气", "基准","阈值", "数值", "仪器","密度", "数据", "触感", "度量","容积","杯壁","玻璃","透明","容器"]),
        GalleryImage(name: "w-7", keywords: ["空", "计量", "感官","空气", "定义","状态", "标记", "边缘","容器", "观察者", "体积", "阴影","基准","系统","经验"]),
        GalleryImage(name: "w-8", keywords: ["空", "观察者", "台面","咖啡", "咖啡渍","杯壁", "手指", "温度","手掌", "感官", "容器", "杯口","金属","容器","液体"]),
        GalleryImage(name: "w-9", keywords: ["空", "城市", "街道","路灯柱", "阴影","光", "边缘", "温度","灯柱", "手指", "无", "空气","感官","定义"]),
        GalleryImage(name: "dc-3", keywords: ["铛铛车", "视线", "历史","光线", "目光","广场", "铛铛", "金色","轮廓","温度","天空", "时间","仪式","阳光"]),
        GalleryImage(name: "js-3", keywords: ["我", "景山公园", "万春亭","目光", "思绪","记忆","历史", "轮廓","天空","层层", "建筑","砖瓦"]),
        GalleryImage(name: "js-4", keywords: ["我", "景山公园", "万春亭","目光", "思绪","记忆","天际", "轮廓","天空","层层","建筑","云彩","石砖","城墙"]),
        GalleryImage(name: "nn-4", keywords: ["我", "手里", "手","钥匙", "金属","边缘","古老","视线","轮廓","手指","目光","痕迹","思绪","指尖","形状"]),
        GalleryImage(name: "nn-5", keywords: ["我","纹理", "记忆", "时间","墙", "痕迹","思绪", "古老", "石板","裂缝", "砖瓦", "裂纹", "石块","纹路","表面","建筑","石块","石砖","城墙","墙面","材质","灰色"]),
        GalleryImage(name: "nn-6", keywords: ["我", "手里", "手","硬币", "金属","边缘","古老","中心","轮廓","手指","目光","痕迹","铜钱","指尖","形状","铜币"]),
        GalleryImage(name: "nn-7", keywords: ["我","纹理", "记忆", "时间","墙", "痕迹","思绪", "古老", "石板","裂缝", "砖瓦", "裂纹", "石块","纹路","表面","建筑","石块","石砖","城墙","墙面","材质","灰色","注意力","手指","指尖","光影","金色","光束","轮廓","阴影","阳光"]),
        GalleryImage(name: "nn-8", keywords: ["我", "视线", "建筑","墙", "墙面","层层", "灰色", "祥云","天空", "视线", "古老","阳光", "街道","天际", "云彩","屋檐"]),
        GalleryImage(name: "nn-9", keywords: ["我", "手里", "手","钥匙", "金属","边缘","古老","视线","轮廓","手指","目光","痕迹","思绪","指尖","形状","手掌","温度","形状"]),
        GalleryImage(name: "nn-10", keywords: ["雨水", "视线", "建筑","墙", "墙面","层层", "灰色", "祥云","天空", "视线", "古老","阳光", "街道","雨滴","天际", "云彩","屋檐"]),
        GalleryImage(name: "nn-11", keywords: ["宫墙", "砖瓦", "建筑","墙", "墙面","石砖", "城墙", "祥云","天空", "红砖", "古老","颜色","天际", "云彩","石纹"]),
        GalleryImage(name: "t-1", keywords: ["宫墙", "砖瓦", "建筑","墙", "墙面","石砖", "城墙","天空", "红砖", "古老","颜色", "天安门","视线","天际", "云彩","我"]),
        GalleryImage(name: "t-2", keywords: ["宫墙", "砖瓦", "建筑","墙", "墙面","层层", "城墙","天空", "红砖", "古老","颜色", "天安门","视线","天际", "云彩","我"]),
        GalleryImage(name: "yd-1", keywords: ["灰色", "砖瓦", "建筑","墙", "墙面","永定门", "城墙","天空", "金色", "古老","阳光", "光线","视线","天际", "云彩","我","光束","轮廓","目光"]),
        GalleryImage(name: "yd-2", keywords: ["灰色", "砖瓦", "建筑","墙", "墙面","永定门", "城墙","天空", "金色", "古老","阳光", "光线","视线","天际", "云彩","我","光束","轮廓","目光"]),
        
        // 以后可以从本地 JSON 或网络加载
    ]
}
